<span style="color:blue">DAY-7</span>

<span style="color:red;"><b> Dataframes </b></span>

<!DOCTYPE html>
<html>
<head>
 
</head>
<body style="background-color: white;">

<h2 style="color: purple; font-style: italic;">
  What are DataFrames in Python?
</h2>

<p style="color: purple; font-style: italic;">
  A <span style="color: purple; font-style: italic;">DataFrame</span> is a 2-dimensional labeled data structure (like a table) provided by the 
  <span style="color: purple; font-style: italic;">Pandas</span> library in Python.
</p>

<p style="color: purple; font-style: italic;">
  Think of it like an <span style="color: purple; font-style: italic;">Excel spreadsheet</span> or a <span style="color: purple; font-style: italic;">SQL table</span>:
</p>

<ul style="color: purple; font-style: italic;">
  <li style="color: purple; font-style: italic;">It has <span style="color: purple; font-style: italic;">rows and columns</span></li>
  <li style="color: purple; font-style: italic;">Each column can have a <span style="color: purple; font-style: italic;">different data type</span> (int, float, string, etc.)</li>
  <li style="color: purple; font-style: italic;">It's very powerful for <span style="color: purple; font-style: italic;">data cleaning, analysis, and visualization</span></li>
</ul>

</body>
</html>

In [3]:
import pandas as pd

In [5]:
df=pd.DataFrame([1,2,3,4,5],columns=["marks"],index=["a","b","c","d","e"],dtype="float")

In [6]:
df

   marks
a    1.0
b    2.0
c    3.0
d    4.0
e    5.0

In [11]:


data = pd.DataFrame({
    'Country': ['INDIA', 'NEPAL', 'PAKISTAN', 'BANGLADESH', 'BHUTAN'],
    'Rank': [1, 2, 3, 4, 5]
})

In [12]:
data

      Country  Rank
0       INDIA     1
1       NEPAL     2
2    PAKISTAN     3
3  BANGLADESH     4
4      BHUTAN     5

In [13]:
data.describe()

           Rank
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  5 non-null      object
 1   Rank     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [15]:
data.sort_values(by="Rank")

      Country  Rank
0       INDIA     1
1       NEPAL     2
2    PAKISTAN     3
3  BANGLADESH     4
4      BHUTAN     5

In [19]:
import numpy as np
data.isnull().sum()

Country    0
Rank       0
dtype: int64

In [21]:
data[data.duplicated()]

Empty DataFrame
Columns: [Country, Rank]
Index: []

In [22]:
data.loc[2]

Country    PAKISTAN
Rank              3
Name: 2, dtype: object

In [23]:
data.value_counts()

Country     Rank
BANGLADESH  4       1
BHUTAN      5       1
INDIA       1       1
NEPAL       2       1
PAKISTAN    3       1
Name: count, dtype: int64

In [26]:
data.groupby('Country')['Rank'].mean()

Country
BANGLADESH    4.0
BHUTAN        5.0
INDIA         1.0
NEPAL         2.0
PAKISTAN      3.0
Name: Rank, dtype: float64